In [1]:
 ## Learning from the Lecture materials.

In [2]:
import pandas as pd
import numpy as np

In [3]:
mySeries = pd.Series([1,-3,5,-20])# note capital S in series
mySeries

0     1
1    -3
2     5
3   -20
dtype: int64

In [4]:
mySeries2 = pd.Series([1,-3,5,-20],index =["a","b","c","d"])
mySeries2

a     1
b    -3
c     5
d   -20
dtype: int64

In [5]:
mySeries2.values

array([  1,  -3,   5, -20], dtype=int64)

In [6]:
mySeries2[2]

5

In [7]:
mySeries2[0:2]

a    1
b   -3
dtype: int64

In [8]:
mySeries2['b']

-3

In [9]:
mySeries2[['b','c']]

b   -3
c    5
dtype: int64

In [10]:
mySeries2['c']= 10
mySeries2

a     1
b    -3
c    10
d   -20
dtype: int64

In [11]:
mySeries2[0]= 26
mySeries2

a    26
b    -3
c    10
d   -20
dtype: int64

### Converting an ARRAY to a Pandas SERIES

In [12]:
myarray = np.array([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
print(myarray)

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15]

In [13]:
print(myarray[0:10])#accessing the first 10 elements in an array
mySeries3 = pd.Series(myarray)# converting the array to pandas series
mySeries3 # calling the series so it can be displayed
print(mySeries3)

[ 1  2  3  4  5  6  7  8  9 10]
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
dtype: int32

In [14]:
mycolors = pd.Series([1,2,3,4,5,4,3,2,1,], index = ['white','black','blue','green','green','yellow','black','red','brown'])
mycolors

white     1
black     2
blue      3
green     4
green     5
yellow    4
black     3
red       2
brown     1
dtype: int64

In [15]:
mycolors.unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [16]:
mycolors.value_counts()

1    2
2    2
3    2
4    2
5    1
dtype: int64

In [17]:
mycolors.isin([5,7])

white     False
black     False
blue      False
green     False
green      True
yellow    False
black     False
red       False
brown     False
dtype: bool

In [18]:
mycolors[mycolors.isin([5,7])]

green    5
dtype: int64

In [19]:
np.log(mySeries3)

0     0.000000
1     0.693147
2     1.098612
3     1.386294
4     1.609438
5     1.791759
6     1.945910
7     2.079442
8     2.197225
9     2.302585
10    2.397895
11    2.484907
12    2.564949
13    2.639057
14    2.708050
dtype: float64

In [20]:
mySeries3[mySeries3>2]

2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
dtype: int32

In [21]:
mydict = {'white':1000,'Black':500,'Red':200,'Green':1000}
mySeries = pd.Series(mydict)
mySeries

white    1000
Black     500
Red       200
Green    1000
dtype: int64

In [22]:
myarray = np.array([2,3,4,5,6,2,34,45,67,89,90,11,12,13,1,2,3,4,5,6])
print(myarray)
mySeries = pd.Series(myarray)
mySeries

[ 2  3  4  5  6  2 34 45 67 89 90 11 12 13  1  2  3  4  5  6]

0      2
1      3
2      4
3      5
4      6
5      2
6     34
7     45
8     67
9     89
10    90
11    11
12    12
13    13
14     1
15     2
16     3
17     4
18     5
19     6
dtype: int32

In [23]:
mydict = {"orange":5,"pineaple":10,"banana":12,"coconut":20,"pawpaw":25,"carrot":26,"mango":28,"plantain":30,"mango":30,"carrot":34,}
mySeries = pd.Series(mydict)
mySeries

orange       5
pineaple    10
banana      12
coconut     20
pawpaw      25
carrot      34
mango       30
plantain    30
dtype: int64

In [24]:
mySeries.value_counts()

30    2
34    1
20    1
5     1
25    1
10    1
12    1
dtype: int64

### Dealing with Pandas DataFrame

In [25]:
mydata = {'Employee Name':['Ashley','TOM','Jack','John','Alicia'],
          'Specialisation':['python','Data science','Data Preparation','Data Analysis','Machine Learning'],
          'Experience(years)':[3,5,8,2,4]}
myframe = pd.DataFrame(mydata)
myframe

  Employee Name    Specialisation  Experience(years)
0        Ashley            python                  3
1           TOM      Data science                  5
2          Jack  Data Preparation                  8
3          John     Data Analysis                  2
4        Alicia  Machine Learning                  4

<div class = "alert alert-block alert-danger">

_There is an alternative way to create a DataFrame._
>And that is to_pass input arguments to the DataFrame constuctor _ in the following order: 
1. a data matrix
2. an array of the labels for the indices (index)
3. an array containihg the column names(columns option)

We use the np.arange() to create the array.
And use the $reshape()$ function to convert the array to a $matrix$

In [26]:
# note that the range requires it multiles as the reshape values
matrix5by8 = np.arange(40).reshape((5,8))

In [27]:


newFrame =pd.DataFrame(np.arange(40).reshape((5,8)),
                        index =['Record-1','Record-2','Record-3','Record-4','Record-5'],
                        columns =['Field-1','Field-2','Field-3','Field-4','Field-5','Field-6','Field-7','Field-8'])
newFrame

,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8
Record-1,0,1,2,3,4,5,6,7
Record-2,8,9,10,11,12,13,14,15
Record-3,16,17,18,19,20,21,22,23
Record-4,24,25,26,27,28,29,30,31
Record-5,32,33,34,35,36,37,38,39

In [28]:
newFrame2 = pd.DataFrame(matrix5by8)
newFrame2

    0   1   2   3   4   5   6   7
0   0   1   2   3   4   5   6   7
1   8   9  10  11  12  13  14  15
2  16  17  18  19  20  21  22  23
3  24  25  26  27  28  29  30  31
4  32  33  34  35  36  37  38  39

In [29]:
mySeriesA = pd.Series(np.random.rand(5),index=[0,1,2,3,4])
# myseries = pd,Series(np.random.rand(5))
mySeriesA

0    0.106708
1    0.891690
2    0.933501
3    0.893659
4    0.944179
dtype: float64

In [30]:
mySeriesB = pd.Series(np.random.rand(5),index = [4,6,7,8,9])                                                     
                                                                                                
mySeriesB

4    0.694075
6    0.178730
7    0.420491
8    0.033436
9    0.626000
dtype: float64

In [31]:
pd.concat([mySeriesA,mySeriesB])

0    0.106708
1    0.891690
2    0.933501
3    0.893659
4    0.944179
4    0.694075
6    0.178730
7    0.420491
8    0.033436
9    0.626000
dtype: float64

In [32]:

df = pd.concat([mySeriesA,mySeriesB],axis=1)

In [33]:
df = pd.concat([mySeriesA,mySeriesB],axis=1,keys=['series1','series2'])

In [34]:
df_notNull = df.dropna(subset =['series1'])
df_notNull

    series1   series2
0  0.106708       NaN
1  0.891690       NaN
2  0.933501       NaN
3  0.893659       NaN
4  0.944179  0.694075

In [35]:
myframeA = pd.DataFrame({'student Name':['I\mking Udonyah','Precious Kingsley','Esther Xttle'],
                        'Sex':['Male','Female','Female'],'Age':[21,33,25],'School':['college','Vocational','Post Graduate']})
                    
myframeA

        student Name     Sex  Age         School
0    I\mking Udonyah    Male   21        college
1  Precious Kingsley  Female   33     Vocational
2       Esther Xttle  Female   25  Post Graduate

In [36]:
myframeB = pd.DataFrame({'Student Name':['Favour Christover','Joshua Pius','Steve Inem'],
                        'Sex':['Female','Male','Male'],'Age':[21,33,25],
                        'School':['College','Voactional','Post Graduate'],
                        'Hostel':['Green','Red','White']})
myframeB

        Student Name     Sex  Age         School Hostel
0  Favour Christover  Female   21        College  Green
1        Joshua Pius    Male   33     Voactional    Red
2         Steve Inem    Male   25  Post Graduate  White

In [37]:
concated_df = pd.concat([myframeA,myframeB])
concated_df

        student Name     Sex  Age         School       Student Name Hostel
0    I\mking Udonyah    Male   21        college                NaN    NaN
1  Precious Kingsley  Female   33     Vocational                NaN    NaN
2       Esther Xttle  Female   25  Post Graduate                NaN    NaN
0                NaN  Female   21        College  Favour Christover  Green
1                NaN    Male   33     Voactional        Joshua Pius    Red
2                NaN    Male   25  Post Graduate         Steve Inem  White

In [38]:
newconcated_df = concated_df.fillna('no student')
newconcated_df

,student Name,Sex,Age,School,Student Name,Hostel
0,I\mking Udonyah,Male,21,college,no student,no student
1,Precious Kingsley,Female,33,Vocational,no student,no student
2,Esther Xttle,Female,25,Post Graduate,no student,no student
0,no student,Female,21,College,Favour Christover,Green
1,no student,Male,33,Voactional,Joshua Pius,Red
2,no student,Male,25,Post Graduate,Steve Inem,White

In [39]:
myframeE = pd.DataFrame({'Staff Name':['Idara Effiong','Edidiong Idiong','Uwem Akpan'],
                        'Department':['Accounts','Sales','Admin'],
                        'Position':['Accountant','Manager','Scretary']})
myframeE

        Staff Name Department    Position
0    Idara Effiong   Accounts  Accountant
1  Edidiong Idiong      Sales     Manager
2       Uwem Akpan      Admin    Scretary

In [40]:
myframeR = pd.DataFrame({'Staff Name':['Wilfred Udo','Udeme Etim','Ephraim Effiong'],
                        'Department':['Inventory','Factory','Security'],
                        'Position':['manager','Cleaner','Officer']})
myframeR

        Staff Name Department Position
0      Wilfred Udo  Inventory  manager
1       Udeme Etim    Factory  Cleaner
2  Ephraim Effiong   Security  Officer

In [41]:
concated = pd.concat([myframeE,myframeR])
concated

        Staff Name Department    Position
0    Idara Effiong   Accounts  Accountant
1  Edidiong Idiong      Sales     Manager
2       Uwem Akpan      Admin    Scretary
0      Wilfred Udo  Inventory     manager
1       Udeme Etim    Factory     Cleaner
2  Ephraim Effiong   Security     Officer

In [42]:
bookFrame1 = pd.DataFrame({'Student Name':['A','B','C'],
                         'Sex':['M','F','M'],'Age':[10,16,17],
                         'School':['primary','High','High']})
bookFrame1

  Student Name Sex  Age   School
0            A   M   10  primary
1            B   F   16     High
2            C   M   17     High

In [43]:
bookFrame2 = pd.DataFrame({'Student Name':['D','E','A'],
                           'Class':['9','10','5'],
                           'School':['Primary','High','High']})
                           
bookFrame2

  Student Name Class   School
0            D     9  Primary
1            E    10     High
2            A     5     High

In [44]:
mergeFrame = pd.merge(bookFrame1,bookFrame2,how = 'right')# Try using left,
mergeFrame

  Student Name  Sex  Age   School Class
0            D  NaN  NaN  Primary     9
1            E  NaN  NaN     High    10
2            A  NaN  NaN     High     5

In [45]:
mergeFrame = pd.merge(bookFrame1,bookFrame2,how = 'left')
mergeFrame

  Student Name Sex  Age   School Class
0            A   M   10  primary   NaN
1            B   F   16     High   NaN
2            C   M   17     High   NaN

In [46]:

mergeFrame = pd.merge(bookFrame1,bookFrame2,how = 'inner')
mergeFrame

Empty DataFrame
Columns: [Student Name, Sex, Age, School, Class]
Index: []

In [47]:
mergeFrame = pd.merge(bookFrame1,bookFrame2,how = 'outer')
mergeFrame

  Student Name  Sex   Age   School Class
0            A    M  10.0  primary   NaN
1            B    F  16.0     High   NaN
2            C    M  17.0     High   NaN
3            D  NaN   NaN  Primary     9
4            E  NaN   NaN     High    10
5            A  NaN   NaN     High     5

In [48]:
mergedSchool = pd.merge(bookFrame1,bookFrame2,on = 'School')
mergedSchool

  Student Name_x Sex  Age School Student Name_y Class
0              B   F   16   High              E    10
1              B   F   16   High              A     5
2              C   M   17   High              E    10
3              C   M   17   High              A     5

In [49]:
mergedSchool = pd.merge(bookFrame1,bookFrame2,on = 'Student Name')
mergedSchool

  Student Name Sex  Age School_x Class School_y
0            A   M   10  primary     5     High

In [50]:
# Renaming the coloumns of the DataFrame
bookFrame2.columns = ['StudentsNames','Class','Institition']# Renames bookFrame2
joinedFrame = bookFrame1.join(bookFrame2)
joinedFrame

  Student Name Sex  Age   School StudentsNames Class Institition
0            A   M   10  primary             D     9     Primary
1            B   F   16     High             E    10        High
2            C   M   17     High             A     5        High

### Combining Data

In [51]:
SeriesAA = pd.Series([50,40,30,20,10],index = [1,2,3,4,5])
SeriesAA

1    50
2    40
3    30
4    20
5    10
dtype: int64

In [52]:
SeriesBB = pd.Series([100,200,300,400],index = [3,4,5,6])
SeriesBB

3    100
4    200
5    300
6    400
dtype: int64

In [53]:
# To combine the values from SeriesAA,we combine both series
SeriesAA.combine_first(SeriesBB)

1     50.0
2     40.0
3     30.0
4     20.0
5     10.0
6    400.0
dtype: float64

In [54]:
# To keep the values from SeriesBB,we combine both series
SeriesBB.combine_first(SeriesAA)

1     50.0
2     40.0
3    100.0
4    200.0
5    300.0
6    400.0
dtype: float64

### Data Transformation

### Data Mapping

In [55]:
data = {'color':['blue','green','yellow','red','white'],
       'object':['ball','pen','pencil','paper','mug'],
       'price':[1.2,1.0,0.6,0.9,1.7]}
myframe = pd.DataFrame(data)
myframe

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [56]:
mymap = {'blue':'dark blue','green':'light green'}
myframe.replace(mymap)

         color  object  price
0    dark blue    ball    1.2
1  light green     pen    1.0
2       yellow  pencil    0.6
3          red   paper    0.9
4        white     mug    1.7

In [57]:
mySeries = pd.Series([1,2,np.nan,4,5,np.nan])
mySeries.replace(np.nan,0)

0    1.0
1    2.0
2    0.0
3    4.0
4    5.0
5    0.0
dtype: float64

In [58]:
mymap2 = {'ball':'round','pencil':'long','pen':'long','mug':'cylindrical','paper':'rectangular'}
myframe['shape']=myframe['object'].map(mymap2)
myframe

    color  object  price        shape
0    blue    ball    1.2        round
1   green     pen    1.0         long
2  yellow  pencil    0.6         long
3     red   paper    0.9  rectangular
4   white     mug    1.7  cylindrical

In [59]:
reindex = {0:'first',1:'second',2:'third',3:'fourth',4:'fifth'}
myframe=myframe.rename(reindex)
myframe

         color  object  price        shape
first     blue    ball    1.2        round
second   green     pen    1.0         long
third   yellow  pencil    0.6         long
fourth     red   paper    0.9  rectangular
fifth    white     mug    1.7  cylindrical

### Discretization and Binning

In [60]:
readings = [34,39,82,75,16,17,15,74,37,68,22,92,99,54,39,96,17,36,91,86]
bins = [0,25,50,75,100]
mycategory = pd.cut(readings,bins)
mycategory

[(25, 50], (25, 50], (75, 100], (50, 75], (0, 25], ..., (75, 100], (0, 25], (25, 50], (75, 100], (75, 100]]
Length: 20
Categories (4, interval[int64]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [61]:
# counting the number of elements in each bin
pd.value_counts(mycategory)

(75, 100]    6
(0, 25]      5
(25, 50]     5
(50, 75]     4
dtype: int64

In [62]:
# Giving names to the bins
bin_names = ['poor','Below Average','Average','Good']
pd.cut(readings,bins,labels = bin_names)

['Below Average', 'Below Average', 'Good', 'Average', 'poor', ..., 'Good', 'poor', 'Below Average', 'Good', 'Good']
Length: 20
Categories (4, object): ['poor' < 'Below Average' < 'Average' < 'Good']

In [63]:
# The pandas library provides the functions qcut() that divides the data into quantiles.
# qcut ensures that the number of occurrences for each bin is equal, but the range of each bin may vary
pd.qcut(readings,4)

[(31.0, 46.5], (31.0, 46.5], (46.5, 83.0], (46.5, 83.0], (14.999, 31.0], ..., (83.0, 99.0], (14.999, 31.0], (31.0, 46.5], (83.0, 99.0], (83.0, 99.0]]
Length: 20
Categories (4, interval[float64]): [(14.999, 31.0] < (31.0, 46.5] < (46.5, 83.0] < (83.0, 99.0]]

In [64]:
# To check the number of elements in each bin,we use the code below
pd.value_counts(pd.qcut(readings,4))

(14.999, 31.0]    5
(31.0, 46.5]      5
(46.5, 83.0]      5
(83.0, 99.0]      5
dtype: int64

### Aggregating Data

In [65]:
schoolData = {'color':['blue','green','yellow','red','white'],
       'object':['ball','pen','pencil','paper','mug'],
       'price':[1.2,1.0,0.6,0.9,1.7]}
schoolDF = pd.DataFrame(schoolData)
schoolDF

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [66]:
myGroup = schoolDF['price'].groupby(schoolDF['color'])
myGroup.groups

{'blue': [0], 'green': [1], 'red': [3], 'white': [4], 'yellow': [2]}

In [67]:
print("______________________________Group SUM___________________________________")
print(myGroup.sum())
print("")
print("______________________________Group MEAN___________________________________")
print(myGroup.mean())

______________________________Group SUM___________________________________
color
blue      1.2
green     1.0
red       0.9
white     1.7
yellow    0.6
Name: price, dtype: float64

______________________________Group MEAN___________________________________
color
blue      1.2
green     1.0
red       0.9
white     1.7
yellow    0.6
Name: price, dtype: float64

### Hierachical Grouping

In [68]:
myGroupB = schoolDF['price'].groupby([schoolDF['color'],schoolDF['object']])
myGroupB.groups

{('blue', 'ball'): [0], ('green', 'pen'): [1], ('red', 'paper'): [3], ('white', 'mug'): [4], ('yellow', 'pencil'): [2]}

### Let us create a new Dataframe schoolDaFra that is the same as schollDF except for an extra  'red', 'pencil' , 0.8
at index 5

In [69]:
schoolDaFra = schoolDF
schoolDaFra.loc[5] = ['Red','pencil',0.8]
schoolDaFra

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7
5     Red  pencil    0.8

## Now let us group by both color and object

In [70]:
myGroupNewB = schoolDaFra['price'].groupby([schoolDaFra['color'],schoolDaFra['object']])
myGroupNewB.groups

{('Red', 'pencil'): [5], ('blue', 'ball'): [0], ('green', 'pen'): [1], ('red', 'paper'): [3], ('white', 'mug'): [4], ('yellow', 'pencil'): [2]}

In [71]:
oldFrame = newFrame
oldFrame

,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8
Record-1,0,1,2,3,4,5,6,7
Record-2,8,9,10,11,12,13,14,15
Record-3,16,17,18,19,20,21,22,23
Record-4,24,25,26,27,28,29,30,31
Record-5,32,33,34,35,36,37,38,39

In [72]:
print('____________________________columns in oldFrame____________________________________\n')
print(oldFrame.columns)
print('\n__________________________Record in oldFrame_______________________________________\n')
print(oldFrame.index)
print('\n______values in oldFrame\n')
print(oldFrame.values)

____________________________columns in oldFrame____________________________________

Index(['Field-1', 'Field-2', 'Field-3', 'Field-4', 'Field-5', 'Field-6',
       'Field-7', 'Field-8'],
      dtype='object')

__________________________Record in oldFrame_______________________________________

Index(['Record-1', 'Record-2', 'Record-3', 'Record-4', 'Record-5'], dtype='object')

______values in oldFrame

[[ 0  1  2  3  4  5  6  7]
 [ 8  9 10 11 12 13 14 15]
 [16 17 18 19 20 21 22 23]
 [24 25 26 27 28 29 30 31]
 [32 33 34 35 36 37 38 39]]

In [73]:
aDF = oldFrame['Field-2']
aDF

Record-1     1
Record-2     9
Record-3    17
Record-4    25
Record-5    33
Name: Field-2, dtype: int32

In [77]:
oldFrame[1:3]

,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8
Record-2,8,9,10,11,12,13,14,15
Record-3,16,17,18,19,20,21,22,23

In [79]:
  # usin attribute loc to accrss rows by the name of thier indices
oldFrame.loc['Record-3']

Field-1    16
Field-2    17
Field-3    18
Field-4    19
Field-5    20
Field-6    21
Field-7    22
Field-8    23
Name: Record-3, dtype: int32

In [80]:
oldFrame.loc['Record-3'],oldFrame.loc['Record-5']

(Field-1    16
 Field-2    17
 Field-3    18
 Field-4    19
 Field-5    20
 Field-6    21
 Field-7    22
 Field-8    23
 Name: Record-3, dtype: int32,
 Field-1    32
 Field-2    33
 Field-3    34
 Field-4    35
 Field-5    36
 Field-6    37
 Field-7    38
 Field-8    39
 Name: Record-5, dtype: int32)

In [102]:
oldFrame.loc['Field-2'],oldFrame.loc['Field-4']

KeyError: 'Field-2'

In [83]:
oldFrame.columns[1:4]
oldFrame[oldFrame.columns[1:4]]

          Field-2  Field-3  Field-4
Record-1        1        2        3
Record-2        9       10       11
Record-3       17       18       19
Record-4       25       26       27
Record-5       33       34       35

In [84]:
# selecting three rows and two columns
# oldFrame.loc[1:3['Field-3','Field-5']]
oldFrame.loc['Record-1':'Record-3',['Field-3','Field-5']]

          Field-3  Field-5
Record-1        2        4
Record-2       10       12
Record-3       18       20

In [85]:
oldFrame.loc['Record-1':'Record-3',['Field-3','Field-5']]

          Field-3  Field-5
Record-1        2        4
Record-2       10       12
Record-3       18       20

In [88]:
# naming our columns and rows
oldFrame.index.name = 'me'
oldFrame.columns.name ='you'
oldFrame

you,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8
me,,,,,,,,
Record-1,0,1,2,3,4,5,6,7
Record-2,8,9,10,11,12,13,14,15
Record-3,16,17,18,19,20,21,22,23
Record-4,24,25,26,27,28,29,30,31
Record-5,32,33,34,35,36,37,38,39

In [89]:
# Adding new columns and values
oldFrame['Field-9']= np.random.randint(50,size=5)
oldFrame

you,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8,Field-9
me,,,,,,,,,
Record-1,0,1,2,3,4,5,6,7,24
Record-2,8,9,10,11,12,13,14,15,33
Record-3,16,17,18,19,20,21,22,23,44
Record-4,24,25,26,27,28,29,30,31,42
Record-5,32,33,34,35,36,37,38,39,1

In [90]:
# searching for a value
oldFrame[oldFrame.isin([1,24,44,33])]

you,Field-1,Field-2,Field-3,Field-4,Field-5,Field-6,Field-7,Field-8,Field-9
me,,,,,,,,,
Record-1,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,24.0
Record-2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,33.0
Record-3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,44.0
Record-4,24.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Record-5,NaN,33.0,NaN,NaN,NaN,NaN,NaN,NaN,1.0

In [101]:
# calling an existing dataFrame or data structure
myNewFrame = myframe
del myNewFrame['Experience(year)']
myNewFrame

KeyError: 'Experience(year)'

In [94]:
oldNewFrame = oldFrame
del oldNewFrame['Field-3']
oldNewFrame

you,Field-1,Field-2,Field-4,Field-5,Field-6,Field-7,Field-8,Field-9
me,,,,,,,,
Record-1,0,1,3,4,5,6,7,24
Record-2,8,9,11,12,13,14,15,33
Record-3,16,17,19,20,21,22,23,44
Record-4,24,25,27,28,29,30,31,42
Record-5,32,33,35,36,37,38,39,1

In [95]:
# transposing a DataFrame
transposedFrame = oldFrame.T
transposedFrame

me       Record-1  Record-2  Record-3  Record-4  Record-5
you
Field-1         0         8        16        24        32
Field-2         1         9        17        25        33
Field-4         3        11        19        27        35
Field-5         4        12        20        28        36
Field-6         5        13        21        29        37
Field-7         6        14        22        30        38
Field-8         7        15        23        31        39
Field-9        24        33        44        42         1

In [99]:
import pandas as pd
import numpy as np
Abuja_Branch = pd.read_csv(r"C:\Users\Mbuotidem urom\Documents\DATASETS\Abuja_Branch.csv")
Abuja_Branch

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,692-92-5582,B,Abuja,Member,Female,Food and beverages,19742.4,3,2961.36,62188.56,2/20/2019,13:27,Card,59227.2,4.761905,2961.36,5.9
1,351-62-0822,B,Abuja,Member,Female,Fashion accessories,5212.8,4,1042.56,21893.76,2/6/2019,18:07,Epay,20851.2,4.761905,1042.56,4.5
2,529-56-3974,B,Abuja,Member,Male,Electronic accessories,9183.6,4,1836.72,38571.12,3/9/2019,17:03,Cash,36734.4,4.761905,1836.72,6.8
3,299-46-1805,B,Abuja,Member,Female,Sports and travel,33739.2,6,10121.76,212556.96,1/15/2019,16:19,Cash,202435.2,4.761905,10121.76,4.5
4,319-50-3348,B,Abuja,Normal,Female,Home and lifestyle,14508.0,2,1450.80,30466.80,3/11/2019,15:30,Epay,29016.0,4.761905,1450.80,4.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
327,552-44-5977,B,Abuja,Member,Male,Health and beauty,22320.0,8,8928.00,187488.00,1/3/2019,19:08,Card,178560.0,4.761905,8928.00,6.2
328,430-53-4718,B,Abuja,Member,Male,Health and beauty,27133.2,8,10853.28,227918.88,1/28/2019,15:46,Card,217065.6,4.761905,10853.28,8.4
329,602-16-6955,B,Abuja,Normal,Female,Sports and travel,27576.0,10,13788.00,289548.00,1/24/2019,18:10,Epay,275760.0,4.761905,13788.00,6.0
330,690-01-6631,B,Abuja,Normal,Male,Fashion accessories,6296.4,10,3148.20,66112.20,2/22/2019,18:35,Epay,62964.0,4.761905,3148.20,6.6
331,303-96-2227,B,Abuja,Normal,Female,Home and lifestyle,35056.8,10,17528.40,368096.40,3/2/2019,17:16,Epay,350568.0,4.761905,17528.40,4.4

## Exploratory Data Analysis

In [103]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns